In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

/anaconda3/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)

### Operation

1. apply

In [21]:
df = pd.DataFrame([[2,3]]*3, columns=['A', 'B'])

In [22]:
df

   A  B
0  2  3
1  2  3
2  2  3

In [23]:
df.apply(lambda x: x**2, axis=1)

   A  B
0  4  9
1  4  9
2  4  9

2. Stats

In [24]:
df.mean()

A    2.0
B    3.0
dtype: float64

In [28]:
df.mean(1)

0    2.5
1    2.5
2    2.5
dtype: float64

## Merge

In [46]:
data = [{key: np.random.randint(3, 119) for key, value in zip(range(10, 20), range(110, 120))} for i in range(1,30)]
df = pd.DataFrame(data)

In [50]:
peice = [df[3:9], df[12:15], df[17:23]]

1. concat

In [54]:
pd.concat(peice)

     10  11   12   13   14   15   16   17   18   19
3     8  23   39   41  111  106   62   75   40   75
4    64  48   53  112   47   61   89   42   87    8
5    84  71  113   30   87   80   92   82   40  110
6   104  41   80   59   26   38   78   13   92   65
7    22  33   70   87   83   88   75   87   83   17
8    32  53  103   96  108   38   41   16   47   28
12  117  36  108   92   36   90   90   52   73   52
13   97  83   15   21  106   24   19  117    5    4
14   36  80   51   44   75    8   93  101   61   22
17  115  29  117   33   13   59   22   93    5   14
18   20  87   30   66   78   95  115   66   43   68
19  114  91  109   76   53   57    3   54   12   60
20   53  61   13   67  104   42   92   31    7   96
21   76  19  111   15   69   39   34   19   97   28
22   64  42   90  100   19   84   62   70  112   59

2. join

In [73]:
left = pd.DataFrame({'key': ['bla', 'blah'], 'left_val': [2,3]})
right = pd.DataFrame({'key': ['bla', 'bla'], 'right_val': [34,65]})

In [74]:
left

    key  left_val
0   bla         2
1  blah         3

In [75]:
right

   key  right_val
0  bla         34
1  bla         65

In [76]:
pd.merge(left, right, on='key')

   key  left_val  right_val
0  bla         2         34
1  bla         2         65

3. Append

In [82]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])

In [85]:
s = df.iloc[3]

In [86]:
s

A   -0.316640
B   -2.462358
C    0.501178
D   -1.019874
Name: 3, dtype: float64

In [87]:
df

          A         B         C         D
0 -1.908015 -0.271725  0.220394  0.753357
1 -2.417497  0.038121  0.849964 -2.143013
2  0.811674  0.677607  2.631440  0.400840
3 -0.316640 -2.462358  0.501178 -1.019874
4  0.237253  2.013694  1.355747  0.371629
5  0.391367  1.080659  0.404552 -0.974450
6 -1.375644  1.123733 -0.097751  0.770230
7  0.265252 -0.677301  1.738265 -1.088654

In [89]:
df.append(s, ignore_index=True)

          A         B         C         D
0 -1.908015 -0.271725  0.220394  0.753357
1 -2.417497  0.038121  0.849964 -2.143013
2  0.811674  0.677607  2.631440  0.400840
3 -0.316640 -2.462358  0.501178 -1.019874
4  0.237253  2.013694  1.355747  0.371629
5  0.391367  1.080659  0.404552 -0.974450
6 -1.375644  1.123733 -0.097751  0.770230
7  0.265252 -0.677301  1.738265 -1.088654
8 -0.316640 -2.462358  0.501178 -1.019874